### Задание на лабораторную работу
Написать программу для обучения пользователя командной строки вежливости
с использованием перенаправления потоков ввода и вывода через анонимные каналы.
1. Создать два анонимных канала функцией CreatePipe().
2. Запустить процесс cmd.exe, соединив один из созданных каналов с потоком
ввода, а другой канал — с потоками вывода и ошибок дочернего процесса.
3. Считать из канала, связанного с потоком вывода дочернего процесса, все данные
функцией ReadFile() и вывести их на экран.
Указание 1. Считать все данные можно, вызывая ReadFile() раз за разом и проверяя
окончание считанных данных (их количество возвращается параметром
lpNumberOfBytesRead). В условиях ЛР можно считать, что вывод окончен, если
последний символ — '>'.
Указание 2. Функция ReadFile() работает с байтами, а не со строками, и не дописывает
завершающий '\0' в конец считанных данных. Поэтому выводить данные нужно
функцией fwrite(), cout.write() и т. п., но не printf() или оператором <<.
4. Запросить у пользователя полную строку-команду.
5. Если введенная строка не начинается со слова «please» (до первого пробела),
уведомить об этом пользователя и перейти к пункту 4.
6. Если введена строка «thanks», остановить дочерний процесс функцией
TerminateProcess(), закрыть анонимные каналы функцией CloseHandle()
и завершить работу программы.
7. Записать в канал, связанный с потоком ввода дочернего процесса, оставшуюся
часть команды и символ перевода строки '\n'.
8. Перейти к пункту 3 (цикл).
### Результаты работы программы
```
>date /T
Please ask politely!
>please date /T
date /T
02.12.2022
